# CLI tools
brew "git"
brew "jq"
brew "pipx"
brew "tmux"
brew "neovim"
brew "tree-sitter-cli" # required by nvim-treesitter `main` branch (Neovim 0.12+)
brew "direnv"
brew "python@3"
brew "xz"
brew "just"
brew "readline"
brew "poetry"
brew "pyenv"
brew "fzf"
brew "ripgrep"
brew "watch"
brew "mas"
brew "pure"
brew "gh"
brew "openssl"
brew "cmake"
brew "pkg-config"
brew "openjdk@21"

# Apps
cask "wezterm"
cask "iina"
cask "the-unarchiver"
cask "obsidian"
cask "discord"
cask "karabiner-elements"

# Fonts
cask "font-jetbrains-mono-nerd-font"
